#include <stdio.h>


int cao()
{
	int 整;
	double 原, 小;
	
	scanf_s("%lf", &原);
	整 = 原;
	小 = 原 - 整;
	printf("%x.", 整);
	for (int 计 = 0, 余 = 0; 计 < 8 && 小 != 0; 计++)
	{
		小 *= 16;
		余 = 小;
		小 -= 余;
		if (余 < 10)	 printf("%d", 余);
		else if (余 == 10) printf("a");
		else if (余 == 11) printf("b");
		else if (余 == 12) printf("c");
		else if (余 == 13) printf("d");
		else if (余 == 14) printf("e");
		else if (余 == 15) printf("f");
	}
}
int main()
{
	cao();
}

// 运行程序: Ctrl + F5 或调试 >“开始执行(不调试)”菜单
// 调试程序: F5 或调试 >“开始调试”菜单

// 入门使用技巧: 
//   1. 使用解决方案资源管理器窗口添加/管理文件
//   2. 使用团队资源管理器窗口连接到源代码管理
//   3. 使用输出窗口查看生成输出和其他消息
//   4. 使用错误列表窗口查看错误
//   5. 转到“项目”>“添加新项”以创建新的代码文件，或转到“项目”>“添加现有项”以将现有代码文件添加到项目
//   6. 将来，若要再次打开此项目，请转到“文件”>“打开”>“项目”并选择 .sln 文件
